R_2_Config

Router>en
Router#sh ip int br
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0/0   unassigned      YES unset  administratively down down 
GigabitEthernet0/0/1   unassigned      YES unset  administratively down down 
Serial0/1/0            unassigned      YES unset  administratively down down 
Serial0/1/1            unassigned      YES unset  administratively down down 
Serial0/2/0            unassigned      YES unset  administratively down down 
Serial0/2/1            unassigned      YES unset  administratively down down 
Vlan1                  unassigned      YES unset  administratively down down
Router#
Router#conf t
Router(config)#hostname R2
R2(config)#int g0/0/0
R2(config-if)#ip address 192.168.2.1 255.255.255.0
R2(config-if)#no shutdown
R2(config-if)#exit

R2(config)#int s0/1/0
R2(config-if)#ip address 10.0.0.2 255.255.255.252
R2(config-if)#no shutdown
R2(config-if)#exit
R2(config)#
R2(config)#int s0/1/1
R2(config-if)#ip address 11.0.0.1 255.255.255.252
R2(config-if)#no shutdown
R2(config-if)#exit
R2(config)#
					/// EIGRP///
R2(config)#router eigrp 1
R2(config-router)#network 192.168.2.1 0.0.0.255
R2(config-router)#network 10.0.0.0 0.0.0.3
R2(config-router)#network 11.0.0.0 0.0.0.3
R2(config-router)#no auto-summary
R2(config-router)#exit
R2(config)#end
R2#
R2#wr
R2#
				/// DHCP CONFIG///
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#ip dhcp excluded-address 192.168.2.1 192.168.2.10
R2(config)#ip dhcp pool DHCP2
R2(dhcp-config)#?
  default-router  Default routers
  dns-server      Set name server
  domain-name     Domain name
  exit            Exit from DHCP pool configuration mode
  network         Network number and mask
  no              Negate a command or set its defaults
  option          Raw DHCP options
R2(dhcp-config)#network 192.168.2.0 255.255.255.0
R2(dhcp-config)#default-router 192.168.2.1
R2(dhcp-config)#dns-server 192.168.2.1
R2(dhcp-config)#exit
R2(config)#exit
R2#wr
Building configuration...
[OK]
R2#

////////////// VERIFIFCATIONS\\\\\\\\\\\\\\\\\

R2#sh ip int br
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0/0   192.168.2.1     YES manual up                    up 
GigabitEthernet0/0/1   unassigned      YES unset  administratively down down 
Serial0/1/0            10.0.0.2        YES manual up                    up 
Serial0/1/1            11.0.0.1        YES manual up                    up 
Serial0/2/0            unassigned      YES unset  administratively down down 
Serial0/2/1            unassigned      YES unset  administratively down down 
Vlan1                  unassigned      YES unset  administratively down down
R2#


R2#sh ip dhcp binding
IP address       Client-ID/              Lease expiration        Type
                 Hardware address
192.168.2.11     0030.A326.2A32           --                     Automatic
192.168.2.12     0060.2F5E.944C           --                     Automatic
R2#
R2#sh ip eigrp ne
R2#sh ip eigrp neighbors 
IP-EIGRP neighbors for process 1
H   Address         Interface      Hold Uptime    SRTT   RTO   Q   Seq
                                   (sec)          (ms)        Cnt  Num
0   10.0.0.1        Se0/1/0        14   01:05:05  40     1000  0   17
1   11.0.0.2        Se0/1/1        12   00:13:16  40     1000  0   7

R2#


R2#sh ip eigrp t
R2#sh ip eigrp to
R2#sh ip eigrp topology 
IP-EIGRP Topology Table for AS 1/ID(192.168.2.1)

Codes: P - Passive, A - Active, U - Update, Q - Query, R - Reply,
       r - Reply status

P 10.0.0.0/30, 1 successors, FD is 2169856
         via Connected, Serial0/1/0
P 11.0.0.0/30, 1 successors, FD is 2169856
         via Connected, Serial0/1/1
P 192.168.1.0/24, 1 successors, FD is 2172416
         via 10.0.0.1 (2172416/5120), Serial0/1/0
P 192.168.2.0/24, 1 successors, FD is 5120
         via Connected, GigabitEthernet0/0/0
P 192.168.3.0/24, 1 successors, FD is 2172416
         via 11.0.0.2 (2172416/5120), Serial0/1/1
R2#


R2#sh ip route eigrp
     11.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
D    192.168.1.0/24 [90/2172416] via 10.0.0.1, 01:05:24, Serial0/1/0
     192.168.2.0/24 is variably subnetted, 2 subnets, 2 masks
D    192.168.3.0/24 [90/2172416] via 11.0.0.2, 00:13:35, Serial0/1/1

R2#