Configurations
Router 1
Router 2
Router 3

Test Configurations
On Router 1
On Router 2
On Router 3

Router 1 Configuration

Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R1
R1(config)#int g0/0/0
R1(config-if)#ip address 192.168.1.100 255.255.255.0
R1(config-if)#no shutdown

R1(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up

R1(config-if)#int S0/1/0
R1(config-if)#ip address 10.0.0.1 255.255.255.252
R1(config-if)#enc
R1(config-if)#encapsulation ppp
R1(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial0/1/0, changed state to down
R1(config-if)#end
R1#
%SYS-5-CONFIG_I: Configured from console by console

R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#router ospf 1
R1(config-router)#network 192.168.1.0 0.0.0.255 area 10
R1(config-router)#network 10.0.0.0 0.0.0.3 area 10
R1(config-router)#end
R1#
%SYS-5-CONFIG_I: Configured from console by console



Router 2 Configuration

Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R2
R2(config)#int g0/0/0
R2(config-if)#ip address 192.168.2.100 255.255.255.0
R2(config-if)#no shutdown

R2(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up

R2(config-if)#int s0/1/0
R2(config-if)#encapsulation ppp	
R2(config-if)#ip address 10.0.0.2 255.255.255.252
R2(config-if)#no shutdown

R2(config-if)#
%LINK-5-CHANGED: Interface Serial0/1/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/1/0, changed state to up

R2(config-if)#int s0/1/1
R2(config-if)#encapsulation ppp
R2(config-if)#ip address 11.0.0.1 255.255.255.252
R2(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial0/1/1, changed state to down
R2(config-if)#
R2(config-if)#end
R2#
%SYS-5-CONFIG_I: Configured from console by console

R2#
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#router ospf 1
R2(config-router)#network 192.168.2.0 0.0.0.255 area 0
R2(config-router)#network 10.0.0.0 0.0.0.3 area 10 
00:22:46: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.1.100 on Serial0/1/0 from LOADING to FULL, Loading Done

R2(config-router)#network 11.0.0.0 0.0.0.3 area 20
R2(config-router)#end
R2#wr



Router 3 Configuration

Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int g0/0/0
Router(config-if)#ip address 192.168.3.100 255.255.255.0
Router(config-if)#no shut down

Router(config-if)#
Router(config-if)#int s0/1/0
Router(config-if)#encapsulation ppp
Router(config-if)#ip address 11.0.0.2 255.255.255.252
Router(config-if)#no shutdown
Router(config-if)#end
Router#
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router ospf 1
Router(config-router)#network 11.0.0.0 0.0.0.3 area 20
Router(config-router)#network 192.168.3.0 0.0.0.255 area 20
Router(config-router)#end
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#wr



Testing Configurations

on Router 1

R1#sh ip ospf neighbor


Neighbor ID     Pri   State           Dead Time   Address         Interface
192.168.2.100     0   FULL/  -        00:00:32    10.0.0.2        Serial0/1/0
R1#
R1#
R1#sh ip ospf database
            OSPF Router with ID (192.168.1.100) (Process ID 1)

                Router Link States (Area 10)

Link ID         ADV Router      Age         Seq#       Checksum Link count
192.168.1.100   192.168.1.100   1072        0x80000003 0x005f6a 3
192.168.2.100   192.168.2.100   1072        0x80000002 0x0099a9 2

                Summary Net Link States (Area 10)
Link ID         ADV Router      Age         Seq#       Checksum
192.168.2.0     192.168.2.100   1072        0x80000001 0x0057cb
11.0.0.0        192.168.2.100   337         0x80000002 0x00f352
192.168.3.0     192.168.2.100   247         0x80000003 0x00ca15
R1#
R1#
R1#sh ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/8 is variably subnetted, 3 subnets, 2 masks
C       10.0.0.0/30 is directly connected, Serial0/1/0
L       10.0.0.1/32 is directly connected, Serial0/1/0
C       10.0.0.2/32 is directly connected, Serial0/1/0
     11.0.0.0/30 is subnetted, 1 subnets
O IA    11.0.0.0/30 [110/128] via 10.0.0.2, 00:05:41, Serial0/1/0
     192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
C       192.168.1.0/24 is directly connected, GigabitEthernet0/0/0
L       192.168.1.100/32 is directly connected, GigabitEthernet0/0/0
O IA 192.168.2.0/24 [110/65] via 10.0.0.2, 00:18:02, Serial0/1/0
O IA 192.168.3.0/24 [110/129] via 10.0.0.2, 00:04:10, Serial0/1/0

R1#
R1#
R1#sh ip protocols

Routing Protocol is "ospf 1"
  Outgoing update filter list for all interfaces is not set 
  Incoming update filter list for all interfaces is not set 
  Router ID 192.168.1.100
  Number of areas in this router is 1. 1 normal 0 stub 0 nssa
  Maximum path: 4
  Routing for Networks:
    192.168.1.0 0.0.0.255 area 10
    10.0.0.0 0.0.0.3 area 10
  Routing Information Sources:  
    Gateway         Distance      Last Update 
    192.168.1.100        110      00:18:04
    192.168.2.100        110      00:18:04
  Distance: (default is 110)

R1#

On Router 2

R2#
R2#sh ip ospf neighbor


Neighbor ID     Pri   State           Dead Time   Address         Interface
192.168.1.100     0   FULL/  -        00:00:31    10.0.0.1        Serial0/1/0
192.168.3.100     0   FULL/  -        00:00:36    11.0.0.2        Serial0/1/1
R2#
R2#
R2#sh ip ospf database
            OSPF Router with ID (192.168.2.100) (Process ID 1)

                Router Link States (Area 0)

Link ID         ADV Router      Age         Seq#       Checksum Link count
192.168.2.100   192.168.2.100   1221        0x80000002 0x0070d6 1

                Summary Net Link States (Area 0)
Link ID         ADV Router      Age         Seq#       Checksum
10.0.0.0        192.168.2.100   1211        0x80000001 0x000345
192.168.1.0     192.168.2.100   1211        0x80000002 0x00e2ff
11.0.0.0        192.168.2.100   482         0x80000003 0x00f153
192.168.3.0     192.168.2.100   392         0x80000004 0x00c816

                Router Link States (Area 10)

Link ID         ADV Router      Age         Seq#       Checksum Link count
192.168.2.100   192.168.2.100   1217        0x80000002 0x0099a9 2
192.168.1.100   192.168.1.100   1217        0x80000003 0x005f6a 3

                Summary Net Link States (Area 10)
Link ID         ADV Router      Age         Seq#       Checksum
192.168.2.0     192.168.2.100   1217        0x80000001 0x0057cb
11.0.0.0        192.168.2.100   482         0x80000002 0x00f352
192.168.3.0     192.168.2.100   392         0x80000003 0x00ca15

                Router Link States (Area 20)

Link ID         ADV Router      Age         Seq#       Checksum Link count
192.168.2.100   192.168.2.100   447         0x80000002 0x00bb84 2
192.168.3.100   192.168.3.100   397         0x80000003 0x003789 3

                Summary Net Link States (Area 20)
Link ID         ADV Router      Age         Seq#       Checksum
192.168.2.0     192.168.2.100   482         0x80000001 0x0057cb
10.0.0.0        192.168.2.100   482         0x80000002 0x000146
192.168.1.0     192.168.2.100   482         0x80000003 0x00e001
R2# 
R2#
R2#sh ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/8 is variably subnetted, 3 subnets, 2 masks
C       10.0.0.0/30 is directly connected, Serial0/1/0
C       10.0.0.1/32 is directly connected, Serial0/1/0
L       10.0.0.2/32 is directly connected, Serial0/1/0
     11.0.0.0/8 is variably subnetted, 3 subnets, 2 masks
C       11.0.0.0/30 is directly connected, Serial0/1/1
L       11.0.0.1/32 is directly connected, Serial0/1/1
C       11.0.0.2/32 is directly connected, Serial0/1/1
O    192.168.1.0/24 [110/65] via 10.0.0.1, 00:20:29, Serial0/1/0
     192.168.2.0/24 is variably subnetted, 2 subnets, 2 masks
C       192.168.2.0/24 is directly connected, GigabitEthernet0/0/0
L       192.168.2.100/32 is directly connected, GigabitEthernet0/0/0
O    192.168.3.0/24 [110/65] via 11.0.0.2, 00:06:42, Serial0/1/1

R2# 
R2#
R2#sh ip pro
R2#sh ip protocols 

Routing Protocol is "ospf 1"
  Outgoing update filter list for all interfaces is not set 
  Incoming update filter list for all interfaces is not set 
  Router ID 192.168.2.100
  Number of areas in this router is 3. 3 normal 0 stub 0 nssa
  Maximum path: 4
  Routing for Networks:
    192.168.2.0 0.0.0.255 area 0
    10.0.0.0 0.0.0.3 area 10
    11.0.0.0 0.0.0.3 area 20
  Routing Information Sources:  
    Gateway         Distance      Last Update 
    192.168.1.100        110      00:20:35
    192.168.2.100        110      00:07:44
    192.168.3.100        110      00:06:54
  Distance: (default is 110)

R2#


on Router 3

Router#sh ip ospf neighbor


Neighbor ID     Pri   State           Dead Time   Address         Interface
192.168.2.100     0   FULL/  -        00:00:33    11.0.0.1        Serial0/1/0
Router#
Router#
Router#sh ip ospf database
            OSPF Router with ID (192.168.3.100) (Process ID 1)

                Router Link States (Area 20)

Link ID         ADV Router      Age         Seq#       Checksum Link count
192.168.2.100   192.168.2.100   144         0x80000002 0x00bb84 2
192.168.3.100   192.168.3.100   94          0x80000003 0x003789 3

                Summary Net Link States (Area 20)
Link ID         ADV Router      Age         Seq#       Checksum
192.168.2.0     192.168.2.100   179         0x80000001 0x0057cb
10.0.0.0        192.168.2.100   179         0x80000002 0x000146
192.168.1.0     192.168.2.100   179         0x80000003 0x00e001
Router#
Router#
Router#sh ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/30 is subnetted, 1 subnets
O IA    10.0.0.0/30 [110/128] via 11.0.0.1, 00:03:33, Serial0/1/0
     11.0.0.0/8 is variably subnetted, 3 subnets, 2 masks
C       11.0.0.0/30 is directly connected, Serial0/1/0
C       11.0.0.1/32 is directly connected, Serial0/1/0
L       11.0.0.2/32 is directly connected, Serial0/1/0
O IA 192.168.1.0/24 [110/129] via 11.0.0.1, 00:03:33, Serial0/1/0
O IA 192.168.2.0/24 [110/65] via 11.0.0.1, 00:03:33, Serial0/1/0
     192.168.3.0/24 is variably subnetted, 2 subnets, 2 masks
C       192.168.3.0/24 is directly connected, GigabitEthernet0/0/0
L       192.168.3.100/32 is directly connected, GigabitEthernet0/0/0

Router#