R_3_Config

Router>en
Router#sh ip int br
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0/0   unassigned      YES unset  administratively down down 
GigabitEthernet0/0/1   unassigned      YES unset  administratively down down 
Serial0/1/0            unassigned      YES unset  administratively down down 
Serial0/1/1            unassigned      YES unset  administratively down down 
Vlan1                  unassigned      YES unset  administratively down down

Router#
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R3
R3(config)#int g0/0/0
R3(config-if)#ip address 192.168.3.1 255.255.255.0
R3(config-if)#no shutdown
R3(config-if)#exit

R3(config)#
R3(config)#int s0/1/0
R3(config-if)#ip address 11.0.0.2 255.255.255.252
R3(config-if)#no shutdown
R3(config-if)#exit

					///EIGRP///
R3(config)#router eigrp 1
R3(config-router)#network 192.168.3.0 0.0.0.255
R3(config-router)#network 11.0.0.0 0.0.0.3
R3(config-router)#no auto-summary
R3(config-router)#exit
R3(config)#
R3(config)#exit



R3#wr
Building configuration...
[OK]
R3#sh ip int br
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0/0   192.168.3.1     YES manual up                    up 
GigabitEthernet0/0/1   unassigned      YES unset  administratively down down 
Serial0/1/0            11.0.0.1        YES manual up                    up 
Serial0/1/1            unassigned      YES unset  administratively down down 
Vlan1                  unassigned      YES unset  administratively down down
R3#
					///DHCP///
R3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#ip dhcp excluded-address 192.168.3.1 192.168.3.10
R3(config)#ip dhcp pool DHCP3
R3(dhcp-config)#network 192.168.3.0 255.255.255.0
R3(dhcp-config)#default-router 192.168.3.1
R3(dhcp-config)#dns-server 192.168.3.1
R3(dhcp-config)#exit	
R3(config)#exit
R3#
R3#wr

//////////////verification\\\\\\\\\\\\\

R3#sh ip int brief
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0/0   192.168.3.1     YES manual up                    up 
GigabitEthernet0/0/1   unassigned      YES unset  administratively down down 
Serial0/1/0            11.0.0.2        YES manual up                    up 
Serial0/1/1            unassigned      YES manual administratively down down 
Vlan1                  unassigned      YES unset  administratively down down
R3#
R3#


R3#sh ip dhcp binding
IP address       Client-ID/              Lease expiration        Type
                 Hardware address
192.168.3.11     0001.64E6.7803           --                     Automatic
192.168.3.12     0006.2A89.71A8           --                     Automatic
R3#
R3#


R3#sh ip eigrp neighbors 
IP-EIGRP neighbors for process 1
H   Address         Interface      Hold Uptime    SRTT   RTO   Q   Seq
                                   (sec)          (ms)        Cnt  Num
0   11.0.0.1        Se0/1/0        11   00:14:57  40     1000  0   14

R3#



R3#sh ip eigrp topology 
IP-EIGRP Topology Table for AS 1/ID(192.168.3.1)

Codes: P - Passive, A - Active, U - Update, Q - Query, R - Reply,
       r - Reply status

P 10.0.0.0/30, 1 successors, FD is 2681856
         via 11.0.0.1 (2681856/2169856), Serial0/1/0
P 11.0.0.0/24, 1 successors, FD is 2169856
         via Connected, Serial0/1/0
P 192.168.1.0/24, 1 successors, FD is 2684416
         via 11.0.0.1 (2684416/2172416), Serial0/1/0
P 192.168.2.0/24, 1 successors, FD is 2172416
         via 11.0.0.1 (2172416/5120), Serial0/1/0
P 192.168.3.0/24, 1 successors, FD is 5120
         via Connected, GigabitEthernet0/0/0
R3#
R3#
R3#sh ip route eigrp
     10.0.0.0/30 is subnetted, 1 subnets
D       10.0.0.0 [90/2681856] via 11.0.0.1, 00:15:24, Serial0/1/0
     11.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
D    192.168.1.0/24 [90/2684416] via 11.0.0.1, 00:15:24, Serial0/1/0
D    192.168.2.0/24 [90/2172416] via 11.0.0.1, 00:15:24, Serial0/1/0

R3#