##R1 Config

Router>
Router>en
Router#sh ip int br
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0/0   unassigned      YES unset  administratively down down 
GigabitEthernet0/0/1   unassigned      YES unset  administratively down down 
Serial0/1/0            unassigned      YES unset  administratively down down 
Serial0/1/1            unassigned      YES unset  administratively down down 
Vlan1                  unassigned      YES unset  administratively down down
Router#

Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R1
R1(config)#int g0/0/0
R1(config-if)#ip address 192.168.1.1 255.255.255.0
R1(config-if)#no shutdown
R1(config-if)#exit

R1(config)#int s0/1/0 
R1(config-if)#ip address 10.0.0.1 255.255.255.252
R1(config-if)#no shutdown
R1(config-if)#exit

					/// EIGRP CONFIG ///
R1(config)#	
R1(config)#router eig
R1(config)#router eigrp 1
R1(config-router)#network 192.168.1.0 0.0.0.255
R1(config-router)#network 10.0.0.0 0.0.0.3
R1(config-router)#no auto-summary
R1(config-router)#exit
R1(config)#end
R1#wr

					/// DHCP CONFIG///
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#ip dhcp excluded-address 192.168.1.1 192.168.1.10
R1(config)#ip dhcp pool DHCP1
R1(dhcp-config)#network 192.168.1.0 255.255.255.0
R1(dhcp-config)#default-router 192.168.1.1
R1(dhcp-config)#dns-server 192.168.1.1
R1(dhcp-config)#exit
R1(config)#exit
R1#


////////////// VERIFIFCATIONS\\\\\\\\\\\\\\\\\
R1#
R1#sh ip int brief
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0/0   192.168.1.1     YES manual up                    up 
GigabitEthernet0/0/1   unassigned      YES unset  administratively down down 
Serial0/1/0            10.0.0.1        YES manual up                    up 
Serial0/1/1            unassigned      YES unset  administratively down down 
Vlan1                  unassigned      YES unset  administratively down down
R1#
R1#

R1#sh ip dhcp binding
IP address       Client-ID/              Lease expiration        Type
                 Hardware address
192.168.1.11     0009.7C14.68DB           --                     Automatic
192.168.1.12     0001.43D1.0528           --                     Automatic
R1#



R1#sh ip eigrp neigh
R1#sh ip eigrp neighbors 
IP-EIGRP neighbors for process 1
H   Address         Interface      Hold Uptime    SRTT   RTO   Q   Seq
                                   (sec)          (ms)        Cnt  Num
0   10.0.0.2        Se0/1/0        11   01:01:47  40     1000  0   13

R1#
R1#


R1#sh ip eigrp topology
IP-EIGRP Topology Table for AS 1/ID(192.168.1.1)

Codes: P - Passive, A - Active, U - Update, Q - Query, R - Reply,
       r - Reply status

P 10.0.0.0/30, 1 successors, FD is 2169856
         via Connected, Serial0/1/0
P 11.0.0.0/30, 1 successors, FD is 2681856
         via 10.0.0.2 (2681856/2169856), Serial0/1/0
P 192.168.1.0/24, 1 successors, FD is 5120
         via Connected, GigabitEthernet0/0/0
P 192.168.2.0/24, 1 successors, FD is 2172416
         via 10.0.0.2 (2172416/5120), Serial0/1/0
P 192.168.3.0/24, 1 successors, FD is 2684416
         via 10.0.0.2 (2684416/2172416), Serial0/1/0
R1#
R1#


R1#sh ip route eigrp
     11.0.0.0/30 is subnetted, 1 subnets
D       11.0.0.0 [90/2681856] via 10.0.0.2, 01:02:13, Serial0/1/0
     192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
D    192.168.2.0/24 [90/2172416] via 10.0.0.2, 01:02:13, Serial0/1/0
D    192.168.3.0/24 [90/2684416] via 10.0.0.2, 00:10:24, Serial0/1/0

R1#